Revit 2024 API
BuiltInFailures.DimensionFailures.WrongConstraintInJoistSystemSketch Property
 Structural Beam System sketch can't be constrained to its beam.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId WrongConstraintInJoistSystemSketch { get; }
Visual Basic
Public Shared ReadOnly Property WrongConstraintInJoistSystemSketch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ WrongConstraintInJoistSystemSketch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace